In [1]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
df.columns = ['first_name', 'last_name', 'email']

In [81]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [8]:
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

# Renaming

In [9]:
df.rename(columns={'first_name': 'first', 'last_name': 'last'}, inplace=True)

In [10]:
df.loc[2] = ['John', 'Smith', 'JohnSmith@email.com']

In [11]:
df.loc[2, ['last', 'email']] = ['Doe', 'JohnDoe@email.com']

In [12]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [13]:
df.loc[2, 'last'] = 'Smith'

In [14]:
df.at[2, 'last'] = 'Doe'

In [15]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

# Filtering

In [16]:
filt = (df['email'] == 'JohnDoe@email.com')
df[filt]['last'] = 'Smith'

C:\Users\wasif\AppData\Local\Temp\ipykernel_17840\1842663546.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]['last'] = 'Smith'

In [17]:
filt = (df['email'] == 'JohnDoe@email.com')
df.loc[filt, 'last'] = 'Smith'

In [18]:
df['email'] = df['email'].str.lower()

In [19]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

# Apply Function

In [20]:
df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [22]:
def update_email(email):
    return email.upper()

In [24]:
df['email']=df['email'].apply(update_email)

In [25]:
df

   first     last                    email
0  Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1   Jane      Doe        JANEDOE@EMAIL.COM
2   John    Smith        JOHNDOE@EMAIL.COM

In [26]:
df['email']=df['email'].apply(lambda x: x.lower())

In [27]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [28]:
df.apply(pd.Series.min)

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [29]:
df.apply(pd.Series.max)

first                 John
last                 Smith
email    johndoe@email.com
dtype: object

In [32]:
df.apply(lambda x: x.min())

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

# Map Function

In [34]:
df.applymap(len)

   first  last  email
0      5     7     23
1      4     3     17
2      4     5     17

In [39]:
df.applymap(str.lower)

   first     last                    email
0  corey  schafer  coreymschafer@gmail.com
1   jane      doe        janedoe@email.com
2   john    smith        johndoe@email.com

In [45]:
df["first"]=df["first"].replace({'Corey': "Charis","Jane": "Jeem"})

In [46]:
df

    first     last                    email
0  Charis  Schafer  coreymschafer@gmail.com
1    Jeem      Doe        janedoe@email.com
2    John    Smith        johndoe@email.com

# Adding and Removing Rows And ColumnsFrom DataFrame

In [65]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [66]:
df=pd.DataFrame(people)

In [67]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

# Add Multiple Columns

In [68]:
df['full_name']=df["first"]+" "+df["last"]

In [69]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [74]:
df.drop(columns=["first","last"],inplace=True)

In [78]:
df['full_name'].str.split(" ",expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [79]:
df[["first","last"]]=df['full_name'].str.split(" ",expand=True)

In [80]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [82]:
df.append({"first":"Tony"},ignore_index=True)

C:\Users\wasif\AppData\Local\Temp\ipykernel_17840\3818590352.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({"first":"Tony"},ignore_index=True)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

# Merging DataFrame

In [123]:
people = {
    "first": ["Adam", 'John'], 
    "last": ["Doe", 'Doe'], 
    "email": ["stark@gmail.com", 'steve@email.com']
}

In [124]:
df2=pd.DataFrame(people)

In [125]:
df2

  first last            email
0  Adam  Doe  stark@gmail.com
1  John  Doe  steve@email.com

In [126]:
df=df.append(df2,ignore_index=True,sort=False)

C:\Users\wasif\AppData\Local\Temp\ipykernel_17840\116530075.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df=df.append(df2,ignore_index=True,sort=False)

In [127]:
df

                      email      full_name  first     last
0   CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1         JaneDoe@email.com       Jane Doe   Jane      Doe
2         JohnDoe@email.com       John Doe   John      Doe
3           stark@gmail.com            NaN  Toney    Stark
4           steve@email.com            NaN  Steve    James
5           stark@gmail.com            NaN  Toney    Stark
6           steve@email.com            NaN  Steve    James
7           stark@gmail.com            NaN  Toney    Stark
8           steve@email.com            NaN  Steve    James
9           stark@gmail.com            NaN  Toney    Stark
10          steve@email.com            NaN  Steve    James
11          stark@gmail.com            NaN  Toney    Stark
12          steve@email.com            NaN  Steve    James
13          stark@gmail.com            NaN   Adam      Doe
14          steve@email.com            NaN   John      Doe

In [128]:
filt=df['last']=="Doe"
df.drop(index=df[filt].index)

                      email      full_name  first     last
0   CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3           stark@gmail.com            NaN  Toney    Stark
4           steve@email.com            NaN  Steve    James
5           stark@gmail.com            NaN  Toney    Stark
6           steve@email.com            NaN  Steve    James
7           stark@gmail.com            NaN  Toney    Stark
8           steve@email.com            NaN  Steve    James
9           stark@gmail.com            NaN  Toney    Stark
10          steve@email.com            NaN  Steve    James
11          stark@gmail.com            NaN  Toney    Stark
12          steve@email.com            NaN  Steve    James

# Sorting Data

In [129]:
df.sort_values(by="full_name")

                      email      full_name  first     last
0   CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1         JaneDoe@email.com       Jane Doe   Jane      Doe
2         JohnDoe@email.com       John Doe   John      Doe
3           stark@gmail.com            NaN  Toney    Stark
4           steve@email.com            NaN  Steve    James
5           stark@gmail.com            NaN  Toney    Stark
6           steve@email.com            NaN  Steve    James
7           stark@gmail.com            NaN  Toney    Stark
8           steve@email.com            NaN  Steve    James
9           stark@gmail.com            NaN  Toney    Stark
10          steve@email.com            NaN  Steve    James
11          stark@gmail.com            NaN  Toney    Stark
12          steve@email.com            NaN  Steve    James
13          stark@gmail.com            NaN   Adam      Doe
14          steve@email.com            NaN   John      Doe

In [130]:
df.sort_values(by=['first','last'])

                      email      full_name  first     last
13          stark@gmail.com            NaN   Adam      Doe
0   CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1         JaneDoe@email.com       Jane Doe   Jane      Doe
2         JohnDoe@email.com       John Doe   John      Doe
14          steve@email.com            NaN   John      Doe
4           steve@email.com            NaN  Steve    James
6           steve@email.com            NaN  Steve    James
8           steve@email.com            NaN  Steve    James
10          steve@email.com            NaN  Steve    James
12          steve@email.com            NaN  Steve    James
3           stark@gmail.com            NaN  Toney    Stark
5           stark@gmail.com            NaN  Toney    Stark
7           stark@gmail.com            NaN  Toney    Stark
9           stark@gmail.com            NaN  Toney    Stark
11          stark@gmail.com            NaN  Toney    Stark

In [131]:
df.sort_values(by=['first','last'],ascending=[True,False],inplace=True)

In [132]:
df

                      email      full_name  first     last
13          stark@gmail.com            NaN   Adam      Doe
0   CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1         JaneDoe@email.com       Jane Doe   Jane      Doe
2         JohnDoe@email.com       John Doe   John      Doe
14          steve@email.com            NaN   John      Doe
4           steve@email.com            NaN  Steve    James
6           steve@email.com            NaN  Steve    James
8           steve@email.com            NaN  Steve    James
10          steve@email.com            NaN  Steve    James
12          steve@email.com            NaN  Steve    James
3           stark@gmail.com            NaN  Toney    Stark
5           stark@gmail.com            NaN  Toney    Stark
7           stark@gmail.com            NaN  Toney    Stark
9           stark@gmail.com            NaN  Toney    Stark
11          stark@gmail.com            NaN  Toney    Stark

In [133]:
df.sort_index()

                      email      full_name  first     last
0   CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1         JaneDoe@email.com       Jane Doe   Jane      Doe
2         JohnDoe@email.com       John Doe   John      Doe
3           stark@gmail.com            NaN  Toney    Stark
4           steve@email.com            NaN  Steve    James
5           stark@gmail.com            NaN  Toney    Stark
6           steve@email.com            NaN  Steve    James
7           stark@gmail.com            NaN  Toney    Stark
8           steve@email.com            NaN  Steve    James
9           stark@gmail.com            NaN  Toney    Stark
10          steve@email.com            NaN  Steve    James
11          stark@gmail.com            NaN  Toney    Stark
12          steve@email.com            NaN  Steve    James
13          stark@gmail.com            NaN   Adam      Doe
14          steve@email.com            NaN   John      Doe